//***********************************************
// File: CSnapshotCanary.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CSnapshotCanary
	{
	public:
		unsigned char _0x0[0xb38];
		int    	tick; // 0xb38
		int    	index; // 0xb3c
		int    	a; // 0xb40
		int    	b; // 0xb44
		int    	c; // 0xb48
		int    	d; // 0xb4c
		int    	e; // 0xb50
		int    	f; // 0xb54
		int    	g; // 0xb58
		int    	h; // 0xb5c
		int    	i; // 0xb60
		int    	j; // 0xb64
		int    	k; // 0xb68
		int    	l; // 0xb6c
		int    	m; // 0xb70
		int    	n; // 0xb74
		int    	o; // 0xb78
		int    	p; // 0xb7c
		int    	q; // 0xb80
		int    	r; // 0xb84
		int    	s; // 0xb88
		int    	t; // 0xb8c
		int    	u; // 0xb90
		int    	v; // 0xb94
		int    	w; // 0xb98
		int    	x; // 0xb9c
		int    	y; // 0xba0
		int    	z; // 0xba4
	};
#pragma pack(pop)
